qistoph/ArduinoEmulate/hardware/emulate/x86/boards.txt
menu.cpu=Processor

emulate.name=Emulate Arduino

#emulate.upload.tool=avrdude
#emulate.upload.protocol=arduino

#emulate.bootloader.tool=avrdude
#emulate.bootloader.low_fuses=0xFF
#emulate.bootloader.unlock_bits=0x3F
#emulate.bootloader.lock_bits=0x0F

emulate.build.f_cpu=16000000L
emulate.build.board=AVR_DUEMILANOVE
emulate.build.core=emulate
#emulate.build.variant=standard

emulate.menu.cpu.atmega328=ATmega328

emulate.menu.cpu.atmega328.upload.maximum_size=30720
emulate.menu.cpu.atmega328.upload.maximum_data_size=2048
emulate.menu.cpu.atmega328.upload.speed=57600

#emulate.menu.cpu.atmega328.bootloader.high_fuses=0xDA
#emulate.menu.cpu.atmega328.bootloader.extended_fuses=0x05
#emulate.menu.cpu.atmega328.bootloader.file=atmega/ATmegaBOOT_168_atmega328.hex

emulate.menu.cpu.atmega328.build.mcu=atmega328p
